<template>
  <div class="q-pa-none q-ma-none">
    <!-- <q-btn label="reset" @click="resetcouponList"></q-btn> -->
    <q-card class="transparent" flat>
      <q-card-section class="row items-center q-pa-none">
        <div class="text-h6 text-bold">使用条款</div>
        <q-space />
        <q-btn icon="close" flat round dense v-close-popup />
      </q-card-section>
      <q-card-section>
        <div class="text-body1 text-bold">第一条（目的）</div>
        <div class="text-body2">
          本条款和条件适用于在线中餐企业（电子商务运营商）运营的在线中餐网上商城（以下简称“商城”）提供的互联网相关服务（以下简称“服务”）的使用。其目的是界定权利、义务和责任※“即使是使用PC通信、无线等的电子商务，只要不违背其本质，也比照适用本条款。”
        </div>
        <div class="text-body1 text-bold">第二条（定义）</div>
        <div class="text-body2">
          ①“商城”是指网络中餐企业设立的利用计算机等信息通信设施向用户提供商品或服务（以下简称“商品等”）进行商品交易的虚拟经营场所，等等，它也用于经营网络商城的经营者的意义上。
          ② “用户”是指按照本条款访问“商城”并接受“商城”提供的服务的会员和非会员。
          ③
          “会员”是指通过向“商城”提供个人信息注册为会员，持续接收来自“商城”的信息，可以继续使用“商城”提供的服务的人。
          ④ “非会员”是指未加入会员而使用“商城”提供的服务的人。
        </div>
        <div class="text-body1 text-bold">
          第三条（条款的明确、解释、修改等）
        </div>
        <div class="text-body2">
          ①
          “商城”是指本条款的内容、商号及代表人姓名、营业地址（包括可以处理消费者投诉的地址）、电话号码、传真号码、电子邮件地址、商业登记号码、通讯号码。销售业务报告编号和个人信息管理负责人均张贴在stok网上商城的初始服务屏幕（正面）上，以便用户轻松了解。然而，用户可以通过连接屏幕查看条款和条件的内容。
          ② “鼹鼠是
          在用户同意条款和条件之前，必须提供单独的连接屏幕或弹出屏幕以获取用户的确认，以便用户了解其中的撤销订阅、交付责任和退款条件等重要内容。条款及条件所列明的内容。
          ③
          “商城”是指电子商务消费者保护法等、条款规范法、电子商务基本法、电子签名法、
          在不违反《信息通信网络利用促进法》、《上门销售法》等相关法律以及《消费者保护法》的范围内，可以对这些条款和条件进行修改。
          ④
          “商城”修改条款时，应注明申请日期及修改理由，并自生效日前7天起至生效日止，与现行条款一起在商城首页公布。生效日期前一天。但若协议内容发生不利于用户的变更，将提前至少30天的宽限期予以通知。在这种情况下，“商城”将改版前后的内容清晰地​​进行了对比并展示出来，以便用户轻松理解。
          ⑤
          “商城”修改条款时，修改后的条款仅适用于适用日之后签订的合同，修改前的条款的规定适用于该日期之前已签订的合同。但是，如果已经签订合同的用户在根据第3项规定的修改条款的通知期限内向‘商城’传达了遵守修改条款的规定的意愿，并收到了经“商城”同意后，适用修改后的条款规定。可以的。
          ⑥
          本条款未尽事宜及本条款的解释适用《电子商务消费者保护法》、《条款规范法》、《电子商务消费者保护指南》等法律。
          . 由公平贸易委员会制定，以及相关法律或商业惯例。遵循
        </div>
        <div class="text-body1 text-bold">第四条（服务的提供和变更）</div>
        <div class="text-body2">
          ① “商城”执行以下任务。 1. 提供商品或服务信息并签订购买合同 2.
          交付已签订购买合同的商品或服务 3. “商城”规定的其他事项 ②
          “商城”商品缺货或服务或技术规格等的变更，所提供的商品或服务的内容可能会因将来签订的合同而改变。在这种情况下，变更的商品或服务的内容以及交付日期被指定并立即通知到当前商品或服务的内容的发布地点。
          ③
          “商城”与用户签订的服务内容因缺货或技术规格变更等原因发生变更时，将立即向用户可以通知的地址通知其原因。
          ④
          前项情况下，“商城”对用户遭受的损失进行赔偿。但若“商城”证明无故意或过失，则不在此限。
        </div>
        <div class="text-body1 text-bold">第五条（暂停服务）</div>
        <div class="text-body2">
          ①
          “商城”因计算机等信息通信设备的维护、检查、更换、故障、通信中断等情况，可以暂时停止提供服务。
          ②
          “商城”因第一项原因暂时停止提供服务而对用户或第三方造成的损失进行赔偿。但若“商城”证明无故意或过失，则不在此限。
          ③
          因事业项目转换、放弃事业、企业间合并等原因而无法提供服务时，“商城”按照第8条规定的方法通知用户，并按照规定通知消费者。条件最初由“商城”建议。奖励给但若“商城”未告知补偿标准等，则里程或
          积分等以与“商城”使用的货币价值等值的实物或现金支付给用户。
        </div>
        <div class="text-body1 text-bold">第六条（会员注册）</div>
        <div class="text-body2">
          ①
          用户按照“商城”设定的注册表格填写会员信息，并表示同意本条款的意向，申请加入会员。
          ② “商城”是指第一项
          共同申请加入会员的用户中，除有下列情形之一的，将登记为会员。 1.
          入会申请者曾根据本条款第7条第3项规定丧失会员资格，但根据第7条第3项规定丧失会员资格后已满3年，同意重新申请会员资格。
          - 注册为“商城”会员时，以下情况除外： 2.
          注册信息有虚假、遗漏或拼写错误时 3.
          判断“商城”的技术对会员注册造成重大阻碍时 ③
          会员合同成立的时间由“商城”决定“商城”对会员的同意直至达成。 ④
          根据第十五条第一项规定，注册信息发生变更时，会员必须立即通过电子邮件等方式通知“商城”。
        </div>
      </q-card-section>
    </q-card>
  </div>
</template>

<script>
  import {defineComponent} from 'vue';

  export default defineComponent({
    name: 'ServicePolicy',
  });
</script>
